grevaillot/svd_tools/headers/STM32F7x3/dma2.h
/** DMA2_LIFCR_CTCIF3 Stream x clear transfer complete interrupt flag (x = 3..0) **/
#define DMA2_LIFCR_CTCIF3		(1 << 27)
/** DMA2_LIFCR_CHTIF3 Stream x clear half transfer interrupt flag (x = 3..0) **/
#define DMA2_LIFCR_CHTIF3		(1 << 26)
/** DMA2_LIFCR_CTEIF3 Stream x clear transfer error interrupt flag (x = 3..0) **/
#define DMA2_LIFCR_CTEIF3		(1 << 25)
/** DMA2_LIFCR_CDMEIF3 Stream x clear direct mode error interrupt flag (x = 3..0) **/
#define DMA2_LIFCR_CDMEIF3		(1 << 24)
/** DMA2_LIFCR_CFEIF3 Stream x clear FIFO error interrupt flag (x = 3..0) **/
#define DMA2_LIFCR_CFEIF3		(1 << 22)
/** DMA2_LIFCR_CTCIF2 Stream x clear transfer complete interrupt flag (x = 3..0) **/
#define DMA2_LIFCR_CTCIF2		(1 << 21)
/** DMA2_LIFCR_CHTIF2 Stream x clear half transfer interrupt flag (x = 3..0) **/
#define DMA2_LIFCR_CHTIF2		(1 << 20)
/** DMA2_LIFCR_CTEIF2 Stream x clear transfer error interrupt flag (x = 3..0) **/
#define DMA2_LIFCR_CTEIF2		(1 << 19)
/** DMA2_LIFCR_CDMEIF2 Stream x clear direct mode error interrupt flag (x = 3..0) **/
#define DMA2_LIFCR_CDMEIF2		(1 << 18)
/** DMA2_LIFCR_CFEIF2 Stream x clear FIFO error interrupt flag (x = 3..0) **/
#define DMA2_LIFCR_CFEIF2		(1 << 16)
/** DMA2_LIFCR_CTCIF1 Stream x clear transfer complete interrupt flag (x = 3..0) **/
#define DMA2_LIFCR_CTCIF1		(1 << 11)
/** DMA2_LIFCR_CHTIF1 Stream x clear half transfer interrupt flag (x = 3..0) **/
#define DMA2_LIFCR_CHTIF1		(1 << 10)
/** DMA2_LIFCR_CTEIF1 Stream x clear transfer error interrupt flag (x = 3..0) **/
#define DMA2_LIFCR_CTEIF1		(1 << 9)
/** DMA2_LIFCR_CDMEIF1 Stream x clear direct mode error interrupt flag (x = 3..0) **/
#define DMA2_LIFCR_CDMEIF1		(1 << 8)
/** DMA2_LIFCR_CFEIF1 Stream x clear FIFO error interrupt flag (x = 3..0) **/
#define DMA2_LIFCR_CFEIF1		(1 << 6)
/** DMA2_LIFCR_CTCIF0 Stream x clear transfer complete interrupt flag (x = 3..0) **/
#define DMA2_LIFCR_CTCIF0		(1 << 5)
/** DMA2_LIFCR_CHTIF0 Stream x clear half transfer interrupt flag (x = 3..0) **/
#define DMA2_LIFCR_CHTIF0		(1 << 4)
/** DMA2_LIFCR_CTEIF0 Stream x clear transfer error interrupt flag (x = 3..0) **/
#define DMA2_LIFCR_CTEIF0		(1 << 3)
/** DMA2_LIFCR_CDMEIF0 Stream x clear direct mode error interrupt flag (x = 3..0) **/
#define DMA2_LIFCR_CDMEIF0		(1 << 2)
/** DMA2_LIFCR_CFEIF0 Stream x clear FIFO error interrupt flag (x = 3..0) **/
#define DMA2_LIFCR_CFEIF0		(1 << 0)

/**@}*/

/** @defgroup dma2_hifcr HIFCR high interrupt flag clear register
@{*/

/** DMA2_HIFCR_CTCIF7 Stream x clear transfer complete interrupt flag (x = 7..4) **/
#define DMA2_HIFCR_CTCIF7		(1 << 27)
/** DMA2_HIFCR_CHTIF7 Stream x clear half transfer interrupt flag (x = 7..4) **/
#define DMA2_HIFCR_CHTIF7		(1 << 26)
/** DMA2_HIFCR_CTEIF7 Stream x clear transfer error interrupt flag (x = 7..4) **/
#define DMA2_HIFCR_CTEIF7		(1 << 25)
/** DMA2_HIFCR_CDMEIF7 Stream x clear direct mode error interrupt flag (x = 7..4) **/
#define DMA2_HIFCR_CDMEIF7		(1 << 24)
/** DMA2_HIFCR_CFEIF7 Stream x clear FIFO error interrupt flag (x = 7..4) **/
#define DMA2_HIFCR_CFEIF7		(1 << 22)
/** DMA2_HIFCR_CTCIF6 Stream x clear transfer complete interrupt flag (x = 7..4) **/
#define DMA2_HIFCR_CTCIF6		(1 << 21)
/** DMA2_HIFCR_CHTIF6 Stream x clear half transfer interrupt flag (x = 7..4) **/
#define DMA2_HIFCR_CHTIF6		(1 << 20)
/** DMA2_HIFCR_CTEIF6 Stream x clear transfer error interrupt flag (x = 7..4) **/
#define DMA2_HIFCR_CTEIF6		(1 << 19)
/** DMA2_HIFCR_CDMEIF6 Stream x clear direct mode error interrupt flag (x = 7..4) **/
#define DMA2_HIFCR_CDMEIF6		(1 << 18)
/** DMA2_HIFCR_CFEIF6 Stream x clear FIFO error interrupt flag (x = 7..4) **/
#define DMA2_HIFCR_CFEIF6		(1 << 16)
/** DMA2_HIFCR_CTCIF5 Stream x clear transfer complete interrupt flag (x = 7..4) **/
#define DMA2_HIFCR_CTCIF5		(1 << 11)
/** DMA2_HIFCR_CHTIF5 Stream x clear half transfer interrupt flag (x = 7..4) **/
#define DMA2_HIFCR_CHTIF5		(1 << 10)
/** DMA2_HIFCR_CTEIF5 Stream x clear transfer error interrupt flag (x = 7..4) **/
#define DMA2_HIFCR_CTEIF5		(1 << 9)
/** DMA2_HIFCR_CDMEIF5 Stream x clear direct mode error interrupt flag (x = 7..4) **/
#define DMA2_HIFCR_CDMEIF5		(1 << 8)
/** DMA2_HIFCR_CFEIF5 Stream x clear FIFO error interrupt flag (x = 7..4) **/
#define DMA2_HIFCR_CFEIF5		(1 << 6)
/** DMA2_HIFCR_CTCIF4 Stream x clear transfer complete interrupt flag (x = 7..4) **/
#define DMA2_HIFCR_CTCIF4		(1 << 5)
/** DMA2_HIFCR_CHTIF4 Stream x clear half transfer interrupt flag (x = 7..4) **/
#define DMA2_HIFCR_CHTIF4		(1 << 4)
/** DMA2_HIFCR_CTEIF4 Stream x clear transfer error interrupt flag (x = 7..4) **/
#define DMA2_HIFCR_CTEIF4		(1 << 3)
/** DMA2_HIFCR_CDMEIF4 Stream x clear direct mode error interrupt flag (x = 7..4) **/
#define DMA2_HIFCR_CDMEIF4		(1 << 2)
/** DMA2_HIFCR_CFEIF4 Stream x clear FIFO error interrupt flag (x = 7..4) **/
#define DMA2_HIFCR_CFEIF4		(1 << 0)

/**@}*/

/** @defgroup dma2_s0cr S0CR stream x configuration register
@{*/


#define DMA2_S0CR_CHSEL_SHIFT		25
#define DMA2_S0CR_CHSEL_MASK		0x07
/** @defgroup dma2_s0cr_chsel CHSEL Channel selection
@{*/
/**@}*/


#define DMA2_S0CR_MBURST_SHIFT		23
#define DMA2_S0CR_MBURST_MASK		0x03
/** @defgroup dma2_s0cr_mburst MBURST Memory burst transfer configuration
@{*/
/**@}*/


#define DMA2_S0CR_PBURST_SHIFT		21
#define DMA2_S0CR_PBURST_MASK		0x03
/** @defgroup dma2_s0cr_pburst PBURST Peripheral burst transfer configuration
@{*/
/**@}*/

/** DMA2_S0CR_CT Current target (only in double buffer mode) **/
#define DMA2_S0CR_CT		(1 << 19)
/** DMA2_S0CR_DBM Double buffer mode **/
#define DMA2_S0CR_DBM		(1 << 18)

#define DMA2_S0CR_PL_SHIFT		16
#define DMA2_S0CR_PL_MASK		0x03
/** @defgroup dma2_s0cr_pl PL Priority level
@{*/
/**@}*/

/** DMA2_S0CR_PINCOS Peripheral increment offset size **/
#define DMA2_S0CR_PINCOS		(1 << 15)

#define DMA2_S0CR_MSIZE_SHIFT		13
#define DMA2_S0CR_MSIZE_MASK		0x03
/** @defgroup dma2_s0cr_msize MSIZE Memory data size
@{*/
/**@}*/


#define DMA2_S0CR_PSIZE_SHIFT		11
#define DMA2_S0CR_PSIZE_MASK		0x03
/** @defgroup dma2_s0cr_psize PSIZE Peripheral data size
@{*/
/**@}*/

/** DMA2_S0CR_MINC Memory increment mode **/
#define DMA2_S0CR_MINC		(1 << 10)
/** DMA2_S0CR_PINC Peripheral increment mode **/
#define DMA2_S0CR_PINC		(1 << 9)
/** DMA2_S0CR_CIRC Circular mode **/
#define DMA2_S0CR_CIRC		(1 << 8)

